var data = {
	"types" : [
    {
        "ID": "bl",
        "Name": "Деловая логика",
        "Icon": "■"
    },
    {
        "ID": "wl",
        "Name": "Структурная логика",
        "Icon": "□"
    },
    {
        "ID": "be",
        "Name": "Этика эмоций",
        "Icon": "☻"
    },
    {
        "ID": "we",
        "Name": "Этика отношений",
        "Icon": "☺"
    },
    {
        "ID": "bs",
        "Name": "Волевая сенсорика",
        "Icon": "●"
    },
    {
        "ID": "ws",
        "Name": "Сенсорика ощищений",
        "Icon": "○"
    },

    {
        "ID": "bi",
        "Name": "Интуиция возможностей",
        "Icon": "▲"
    },
    {
        "ID": "wi",
        "Name": "Интуиция времени",
        "Icon": "Δ"
    }
]
,
	"semantic" : {
    "bl": {
        "rootGroups": [
            {
                "roots": [ "\\w*(дел)\\w*" ],
                "excludes": [ "\\w*(дели)\\w*", "\\w*(делы)\\w*" ]
            },
            {
                "roots": [ "(метод)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(знан)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(механ)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(польз)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(работ)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(реш)\\w*" ],
                "excludes": [ "(греш)\\w*", "\\w*(решит)\\w*" ]
            },
            {
                "roots": [ "\\w*(выгод)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(алгоритм)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(факт)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(целеесообразность)" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(применен)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(навык)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(инструмент)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(конструктив)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(прагматизм)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(оптимальн)\\w*", "(оптимален)" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(эффектив)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(труд)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(стоимост)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(продукт)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(результат)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(производительн)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(квалиффикац)\\w*", "\\w*(квалиффиц)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(компетентн)\\w*" ],
                "excludes": [ ]
            }
        ]
    },
    "wl": {
        "rootGroups": [
            {
                "roots": [ "\\w*(анализ)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(классификац)\\w*", "\\w*(классифиц)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(признак)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(параметр)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(вид)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(критер)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(пониман)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(основан)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(систем)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(структур)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(соотношен)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(схем)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(сравнен)\\w*", "\\w*(сравнив)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(соответст)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(последовательн)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(закон)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(совокупн)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(взаимосвяз)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(вывод)", "(ряд)" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(противореч)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(выясн)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(обоснов)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(сформулир)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(выдел)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(исключ)\\w*" ],
                "excludes": [ ]
            }
        ]
    },
    "be": {
        "rootGroups": [
            {
                "roots": [ "(возбужд)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(ненавиж)\\w*","(ненавис)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(энерг)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(настро)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(скандал)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(тонус)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(трагед)\\w*", "\\w*(трагич)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(искренн)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(экстаз)" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(интонац)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(улыб)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(развле)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(растормош)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(надут)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(обалд)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(замечательный)", "(бурный)", "(выразительный)", "(грандиозный)", "(неотразимый)", "(великолепный)" ],
                "excludes": [ ]
            }
        ]
    },
    "we": {
        "rootGroups": [
            {
                "roots": [ "\\w*(морал)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(нравственн)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(человечн)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(совест)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(дипломатич)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(скромн)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(добр)\\w*" ],
                "excludes": [ "(добротный)","(подобр)\\w*" ]
            },
            {
                "roots": [ "\\w*(приличн)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(чест)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(унизит)\\w*", "\\w*(униж)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(подло)\\w*","\\w*(подлы)\\w*" ],
                "excludes": [ "\\w*(лов)\\w*" ]
            },
            {
                "roots": [ "\\w*(хам)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(завист)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(высокомер)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(сочуств)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(сострад)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(близк)\\w*" ],
                "excludes": [ "(близко)\\w*" ]
            },
            {
                "roots": [ "(родн)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(друж)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(довер)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(уваж)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(такт)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(вежлив)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(воспитан)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(порядочн)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(привязанн)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(традиции)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(благодар)\\w*" ],
                "excludes": [ ]
            }
        ]
    },
    "bs": {
        "rootGroups": [
            {
                "roots": [ "(власт)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(влия)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(вол)\\w*" ],
                "excludes": [ "\\w*(произвол)\\w*","(удовол)\\w*" ]
            },
            {
                "roots": [ "(мобилизован)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(сил)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(угро)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(борьб)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(аггресс)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(добит)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(преодоле)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(воева)\\w*", "\\w*(войн)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(застав)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(жесток)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(боев)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(мощн)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(лидер)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(решительн)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(давлен)\\w*", "\\w*(дави)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(сражен)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(сопротивл)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(столкнов)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(уверенно)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(защит)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(безопас)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(нападен)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(гранич)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(инициатив)\\w*" ],
                "excludes": [ ]
            }
        ]
    },
    "ws": {
        "rootGroups": [
            {
                "roots": [ "(гармон)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(комфорт)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(красот)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(самочувст)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(организм)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(здоров)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(уют)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(эстет)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(свеж)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(влажн)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(горяч)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(прохлад)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(приятный)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(тепл)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(мягк)\\w*", "(мягок)" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(аккуратн)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(удоб)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(отдых)\\w*", "\\w*(отдох)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(расслаблен)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(утомлен)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(устал)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(вкус)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(запах)\\w*" ],
                "excludes": [ "\\w*(запахив)\\w*", "\\w*(запахн)\\w*" ]
            },
            {
                "roots": [ "\\w*(прикосат)\\w*", "\\w*(прикосн)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(секс)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(нежн)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(блаженс)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(обня)\\w*", "\\w*(обни)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(поглад)\\w*", "\\w*(поглаж)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(приласк)\\w*" ],
                "excludes": [ ]
            }
        ]
    },
    "bi": {
        "rootGroups": [
            {
                "roots": [ "(вдруг)" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(поиск)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(потенциал)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(возможн)\\w*", "\\w*(возможен)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(способн)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(суть)" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(интерес)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(глубок)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(необыч)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(уникал)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(оригинал)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(догад)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(раскрыт)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(изобре)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(талант)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(парадокс)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(намек)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(замыс)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(идей)\\w*", "(идея)", "(иде)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(озарен)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(вариант)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(фантаз)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(пронирцат)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(альтерн)\\w*" ],
                "excludes": [ ]
            }
        ]
    },
    "wi": {
        "rootGroups": [
            {
                "roots": [ "(врем)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(ритм)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(скорост)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(момент)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(пауз)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(период)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(продолжитель)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(срок)\\w*", "\\w*(сроч)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(предупрежд)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(предчувств)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(прогноз)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(изменен)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(темп)\\w*" ],
                "excludes": [ "(темпер)\\w*" ]
            },
            {
                "roots": [ "(ускорен)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(динами)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(судьб)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(знак)\\w*" ],
                "excludes": [ "(при)\\w*" ]
            },
            {
                "roots": [ "\\w*(примет)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "(тайн)\\w*" ],
                "excludes": [ ]
            },
            {
                "roots": [ "\\w*(резонанс)\\w*" ],
                "excludes": [ ]
            }
        ]
    }
}
,
	"preset" : [
    {
        "question": "Что такое настроение человека? Как вы определяете, какое у человека настроение? Если у вас плохое настроение, что вы делаете, чтобы его улучшить? ",
        "type": "be"
    },
    {
        "question": "Стоит ли открыто проявлять свои эмоции? Что такое «выплескивание» эмоций? Как это происходит? ",
        "type": "be"
    },
    {
        "question": "Как вы определяете отношение к себе окружающих? Если у вас плохие отношения с кем-то, что вы делаете, чтобы их улучшить? ",
        "type": "we"
    },
    {
        "question": "Что у вас вызывает уважение или неуважение к человеку? Что значит «уважать другого человека»? ",
        "type": "we"
    },
    {
        "question": "Что такое работа в вашем представлении? Зачем вообще нужна работа? Какое отношение к работе считается нормальным? ",
        "type": "bl"
    },
    {
        "question": "Что такое профессионализм? Как вы поймёте, что стали профессионалом? ",
        "type": "bl"
    },
    {
        "question": "Что такое логично? Ваше понимание. Согласуется ли ваше понимание логичного с общепринятым? Легко ли вам быть логичным? ",
        "type": "wl"
    },
    {
        "question": "Что такое классификация? Каким образом она осуществляется? Зачем она нужна и где применяется?",
        "type": "wl"
    },
    {
        "question": "Раскройте понятия \"вариант\" и \"возможность\". Это одно и то же? Если нет, поясните различия.",
        "type": "bi"
    },
    {
        "question": "Видите ли вы потенциал в других людях? Когда вы встречаете незнакомого человека, то, что можете сказать о нем сразу же? Как вы понимаете, что он из себя представляет? Долго ли приходится разбираться в качествах человека?",
        "type": "bi"
    },
    {
        "question": "Что такое время? Как вы его чувствуете? Что значит проводить время впустую? Какое время вы считаете проведенным очень правильно и хорошо? ",
        "type": "wi"
    },
    {
        "question": "Вы опаздываете? Как относитесь к опозданиям других? Почему вы опаздываете? ",
        "type": "wi"
    },
    {
        "question": "В каких ситуациях нужно оказывать давление на человека? Можете ли вы надавить на человека? Если да, то, как это происходит?",
        "type": "bs"
    },
    {
        "question": "Расскажите, как понять по человеку, что он сильный? В чём суть силы? Считаете ли вы себя сильным человеком?",
        "type": "bs"
    },
    {
        "question": "Раскройте понятия \"комфорт\" и \"уют\". Это одно и то же? Если нет, поясните различия. Как вы создаёте комфорт и уют? Как вы себя чувствуете, если в доме беспорядок?",
        "type": "ws"
    },
    {
        "question": "Как вы покупаете одежду? Как понимаете, что вам подходит, а что нет? Как реагируете на критику? Даёте ли советы друзьям и знакомым по выбору одежды? От кого принимаете подобные советы и почему?",
        "type": "ws"
    }
]
}