[
    {
        "question": "Что такое настроение человека? Как вы определяете, какое у человека настроение? Если у вас плохое настроение, что вы делаете, чтобы его улучшить? ",
        "type": "be"
    },
    {
        "question": "Стоит ли открыто проявлять свои эмоции? Что такое «выплескивание» эмоций? Как это происходит? ",
        "type": "be"
    },
    {
        "question": "Как вы определяете отношение к себе окружающих? Если у вас плохие отношения с кем-то, что вы делаете, чтобы их улучшить? ",
        "type": "we"
    },
    {
        "question": "Что у вас вызывает уважение или неуважение к человеку? Что значит «уважать другого человека»? ",
        "type": "we"
    },
    {
        "question": "Что такое работа в вашем представлении? Зачем вообще нужна работа? Какое отношение к работе считается нормальным? ",
        "type": "bl"
    },
    {
        "question": "Что такое профессионализм? Как вы поймёте, что стали профессионалом? ",
        "type": "bl"
    },
    {
        "question": "Что такое логично? Ваше понимание. Согласуется ли ваше понимание логичного с общепринятым? Легко ли вам быть логичным? ",
        "type": "wl"
    },
    {
        "question": "Что такое классификация? Каким образом она осуществляется? Зачем она нужна и где применяется?",
        "type": "wl"
    },
    {
        "question": "Раскройте понятия \"вариант\" и \"возможность\". Это одно и то же? Если нет, поясните различия.",
        "type": "bi"
    },
    {
        "question": "Видите ли вы потенциал в других людях? Когда вы встречаете незнакомого человека, то, что можете сказать о нем сразу же? Как вы понимаете, что он из себя представляет? Долго ли приходится разбираться в качествах человека?",
        "type": "bi"
    },
    {
        "question": "Что такое время? Как вы его чувствуете? Что значит проводить время впустую? Какое время вы считаете проведенным очень правильно и хорошо? ",
        "type": "wi"
    },
    {
        "question": "Вы опаздываете? Как относитесь к опозданиям других? Почему вы опаздываете? ",
        "type": "wi"
    },
    {
        "question": "В каких ситуациях нужно оказывать давление на человека? Можете ли вы надавить на человека? Если да, то, как это происходит?",
        "type": "bs"
    },
    {
        "question": "Расскажите, как понять по человеку, что он сильный? В чём суть силы? Считаете ли вы себя сильным человеком?",
        "type": "bs"
    },
    {
        "question": "Раскройте понятия \"комфорт\" и \"уют\". Это одно и то же? Если нет, поясните различия. Как вы создаёте комфорт и уют? Как вы себя чувствуете, если в доме беспорядок?",
        "type": "ws"
    },
    {
        "question": "Как вы покупаете одежду? Как понимаете, что вам подходит, а что нет? Как реагируете на критику? Даёте ли советы друзьям и знакомым по выбору одежды? От кого принимаете подобные советы и почему?",
        "type": "ws"
    }
]